apojomovsky/pic8-hal/pic16f87xa-hal/include/peripherals/pic16f87xa_timer1.h
/**
 * @file    peripherals/pic16f87xa_timer1.h
 * @brief   Timer1 driver — 16-bit timer/counter.
 *
 * @details
 *   Source: DS39582B §6.0 (Timer1 Module), §6.1 (Timer mode),
 *   §6.2 (Counter mode), §6.3 (Synchronized), §6.4 (Asynchronous),
 *   Register 6-1 (T1CON), Table 6-2 (register summary).
 *
 *   Wiring on the part:
 *     - 16-bit counter TMR1H:TMR1L, read/writable.
 *     - Clock source: internal Fosc/4 (TMR1CS=0) or RC0/T1CKI (TMR1CS=1).
 *     - T1OSCEN enables a low-power 32.768 kHz crystal oscillator on
 *       RC0/T1OSO and RC1/T1OSI, intended for real-time-clock use.
 *     - T1SYNC selects whether the external clock is synchronized to
 *       Fosc (synchronous counter) or free-running (asynchronous).
 *     - Prescaler: 1:1, 1:2, 1:4, 1:8.
 *     - Overflow (0xFFFF → 0x0000) sets PIR1<TMR1IF>.
 *
 *   Reset state (DS39582B Table 14-6): T1CON = 0x00 (TMR1ON cleared,
 *   prescaler 1:1, internal clock, T1OSC off, sync). TMR1H/L are
 *   "unknown" on POR.
 *
 *   CCP special-event trigger (DS39582B §6.6) resets TMR1H:TMR1L when
 *   CCP1M3:CCP1M0 = 1011. The driver does not configure that; the CCP
 *   driver does.
 */

#ifndef PIC16F87XA_TIMER1_H
#define PIC16F87XA_TIMER1_H

#include "pic16f87xa.h"
#include "pic16f87xa_sfr.h"

/**
 * @brief Timer1 clock source (T1CON<TMR1CS>, DS39582B Register 6-1).
 */
typedef enum {
    TIMER1_CLOCK_INTERNAL  = 0x0U,   /**< Fosc/4 (timer mode). */
    TIMER1_CLOCK_EXTERNAL  = 0x1U,   /**< External pin or T1OSC. */
} TIMER1_ClockSourceTypeDef;

/**
 * @brief External-clock synchronisation (T1CON<T1SYNC>, DS39582B §6.3/§6.4).
 *        In timer mode (internal clock) this bit is ignored.
 *
 *        Asynchronous mode is required for Sleep-time counting, and is
 *        the default when the T1OSC crystal oscillator is enabled.
 */
typedef enum {
    TIMER1_SYNC_EXTERNAL   = 0x0U,   /**< T1SYNC = 0 — synchronise to Fosc. */
    TIMER1_ASYNC_EXTERNAL  = 0x1U,   /**< T1SYNC = 1 — free-running. */
} TIMER1_ClockSyncTypeDef;

/**
 * @brief T1OSC crystal-oscillator enable (T1CON<T1OSCEN>, DS39582B §6.5).
 *        Requires a 32.768 kHz crystal on T1OSI/T1OSO; the resulting
 *        1 Hz tick rate is the standard RTC time base.
 */
typedef enum {
    TIMER1_OSCILLATOR_OFF  = 0x0U,
    TIMER1_OSCILLATOR_ON   = 0x1U,
} TIMER1_OscillatorTypeDef;

/**
 * @brief Prescaler ratio (T1CON<T1CKPS1:T1CKPS0>, DS39582B Register 6-1).
 */
typedef enum {
    TIMER1_PRESCALER_1_1 = 0x0U,    /**< 1:1  — 00. */
    TIMER1_PRESCALER_1_2 = 0x1U,    /**< 1:2  — 01. */
    TIMER1_PRESCALER_1_4 = 0x2U,    /**< 1:4  — 10. */
    TIMER1_PRESCALER_1_8 = 0x3U,    /**< 1:8  — 11. */
} TIMER1_PrescalerTypeDef;

/** Driver handle (Cube-style). */
typedef struct {
    TIMER1_ClockSourceTypeDef  ClockSource;
    TIMER1_ClockSyncTypeDef    ClockSync;
    TIMER1_OscillatorTypeDef   Oscillator;
    TIMER1_PrescalerTypeDef    Prescaler;
    uint16_t                   ReloadValue;   /**< 16-bit initial counter. */
    /** @brief Optional overflow callback (fires on TMR1IF). */
    void (*OverflowCallback)(void);
} TIMER1_HandleTypeDef;

#define TIMER1_HANDLE_DEFAULT {                                         \
    .ClockSource      = TIMER1_CLOCK_INTERNAL,                          \
    .ClockSync        = TIMER1_SYNC_EXTERNAL,                           \
    .Oscillator       = TIMER1_OSCILLATOR_OFF,                          \
    .Prescaler        = TIMER1_PRESCALER_1_1,                           \
    .ReloadValue      = 0x0000U,                                        \
    .OverflowCallback = NULL,                                           \
}

PIC16F87XA_StatusTypeDef HAL_TIMER1_Init(const TIMER1_HandleTypeDef *h);
PIC16F87XA_StatusTypeDef HAL_TIMER1_DeInit(void);
PIC16F87XA_StatusTypeDef HAL_TIMER1_Start(const TIMER1_HandleTypeDef *h);
PIC16F87XA_StatusTypeDef HAL_TIMER1_Stop(void);

/** Atomically read the 16-bit counter value. */
uint16_t HAL_TIMER1_ReadCounter(void);

/** Atomically write the 16-bit counter value. */
void HAL_TIMER1_WriteCounter(uint16_t value);

/** Convert a prescaler enum to its integer ratio (1, 2, 4, 8). */
uint16_t HAL_TIMER1_PrescalerToRatio(TIMER1_PrescalerTypeDef p);

/** Weak Timer1 ISR — override in user code to add application logic. */
void TIMER1_IRQHandler(void) PIC16F87XA_WEAK;

#endif /* PIC16F87XA_TIMER1_H */
